app/Controllers/Admin/Bairros.php

     private function buscaBairroOu404(int $id = null){

        if(!$id || !$bairro = $this->bairroModel->withDeleted(true)->where('id', $id)->first()){
---
SELECT *
FROM `bairros`
WHERE `id` = 1
GROUP BY `bairros`.`id`
ORDER BY `bairros`.`id` ASC
 LIMIT 1