app/Controllers/Admin/Categorias.php

    public function index()
    {

        $data = [

            'titulo' => 'Listando as categorias',
            'categorias' => $this->categoriaModel->withDeleted(true)->paginate(10),
---
SELECT *
FROM `categorias`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `categorias`

    private function buscaCategoriaOu404(int $id = null){

        if(!$id || !$categoria = $this->categoriaModel->withDeleted(true)->where('id', $id)->first()){
---
SELECT *
FROM `categorias`
WHERE `id` = 1
GROUP BY `categorias`.`id`
ORDER BY `categorias`.`id` ASC
 LIMIT 1