app/Controllers/Admin/Home.php

SELECT *
FROM `pedidos`
WHERE `situacao` = 0
AND `pedidos`.`deletado_em` IS NULL
ORDER BY `criado_em` DESC
---
    public function index()
    {

        $data = [
            'titulo' => 'Home da área restrita',
            'valorPedidosEntregues' => $this->pedidoModel->valorPedidosEntregues(),
            'valorPedidosCancelados' => $this->pedidoModel->valorPedidosCancelados(),
            'totalClientesAtivos' => $this->usuarioModel->recuperaTotalClientesAtivos(),
            'totalEntregadoresAtivos' => $this->entregadorModel->recuperaTotalEntregadoresAtivos(),

        ];

        $novosPedidos = $this->pedidoModel->where('situacao', 0)->orderBy('criado_em', 'DESC')->findAll();