app/Controllers/Admin/Medidas.php

    public function index()
    {
        $data = [
            'titulo' => 'Listando as medidas dos produtos',
            'medidas' => $this->medidaModel->withDeleted(true)->paginate(10),
---
SELECT *
FROM `medidas`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `medidas`