app/Controllers/Admin/Produtos.php

SELECT `produtos`.*, `categorias`.`nome` AS `categoria`
FROM `produtos`
JOIN `categorias` ON `categorias`.`id` = `produtos`.`categoria_id`
WHERE `produtos`.`id` = 10
GROUP BY `produtos`.`id`
ORDER BY `produtos`.`id` ASC
 LIMIT 1
---
    private function buscaProdutoOu404(int $id = null){

        if(!$id || !$produto = $this->produtoModel->select('produtos.*, categorias.nome AS categoria')
                                                    ->join('categorias', 'categorias.id = produtos.categoria_id')
                                                    ->where('produtos.id', $id)
                                                    ->withDeleted(true)
                                                    ->first()){