app/Controllers/Admin/Usuarios.php

    private function buscaUsuarioOu404(int $id = null){

        if(!$id || !$usuario = $this->usuarioModel->withDeleted(true)->where('id', $id)->first()){
---
SELECT *
FROM `usuarios`
WHERE `id` = 1
GROUP BY `usuarios`.`id`
ORDER BY `usuarios`.`id` ASC
 LIMIT 1