app/Helpers/empresa_helper.php

        function expedientes(){

            $expedienteModel = new \App\Models\ExpedienteModel();

            return $expedienteModel->findAll();
---
SELECT *
FROM `expediente`

        function expedienteHoje(){

            $expedienteModel = new \App\Models\ExpedienteModel();

            return $expedienteModel->where('dia', date('w'))->first();
---
SELECT *
FROM `expediente`
WHERE `dia` = '5'
 LIMIT 1