app/Controllers/Produto.php

SELECT *
FROM `produtos`
WHERE `slug` = 'src'
AND `ativo` = 1
AND `produtos`.`deletado_em` IS NULL
 LIMIT 1
---
    public function detalhes(string $produto_slug = null)
    {

        //se cair no if, é pq não foi informado o slug ou foi alterado na url

        if(!$produto_slug || !$produto = $this->produtoModel->where('slug', $produto_slug)->where('ativo',true)->first()){

SELECT *
FROM `produtos`
WHERE `slug` = 'src'
AND `ativo` = 1
AND `produtos`.`deletado_em` IS NULL
 LIMIT 1
---
    public function customizar(string $produto_slug = null)
    {

        if(!$produto_slug || !$produto = $this->produtoModel->where('slug', $produto_slug)->where('ativo',true)->first()){