app/Models/EntregadorModel.php

    public function recuperaMelhoresEntregadores(int $quantidade)
    {

        return $this->select('entregadores.nome, entregadores.imagem, COUNT(*) as entregas')
                    ->join('pedidos', 'pedidos.entregador_id = entregadores.id')
                    ->where('pedidos.situacao', 2)
                    ->limit($quantidade)
                    ->groupBy('entregadores.nome, entregadores.imagem')
                    ->orderBy('entregas', 'DESC')
                    ->find();
---
SELECT `entregadores`.`nome`, `entregadores`.`imagem`, COUNT(*) as entregas
FROM `entregadores`
JOIN `pedidos` ON `pedidos`.`entregador_id` = `entregadores`.`id`
WHERE `pedidos`.`situacao` = 2
AND `entregadores`.`deletado_em` IS NULL
GROUP BY `entregadores`.`nome`, `entregadores`.`imagem`
ORDER BY `entregas` DESC
 LIMIT 5