app/Models/UsuarioModel.php

SELECT COUNT(*) AS `numrows`
FROM `usuarios`
WHERE `is_admin` = 0
AND `ativo` = 1
AND `usuarios`.`deletado_em` IS NULL
---
    public function recuperaTotalClientesAtivos()
    {
        return $this->where('is_admin', false)
                    ->where('ativo', true)
                    ->countAllResults();